content-org/o.org
* Locus 🌊
:PROPERTIES:
:EXPORT_FILE_NAME: locus
:EXPORT_HUGO_SECTION: docs
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :weight 2
:END:
#+attr_html: :class book-hint info
#+begin_quote
This page is an overview of all the personal things I host publicly. If you're looking for info about my homepage see [[*Colophon][colophon]]
#+end_quote

These things that I host publicly might be an overkill or maybe not the right way of doing things for some but this is going in the right direction for me, if not perfect. I need external systems and processes in place to help me get the most out of my life.

** Static pages
- [[/][homepage]] : This website
- [[https://mogoz.geekodour.org][mogoz]] : The wiki, some people call it digital garden, evergreen notes etc.
- [[https://diary.geekodour.org][diary]] : The public journal and travel diary
- [[https://ti.geekodour.org][todayi]] : The place to keep my TILs and TIFUs.
- [[https://blog.geekodour.org][blog]] : The blog

