content/docs/locus.md
+++
title = "Locus 🌊"
author = ["Hrishikesh Barman"]
draft = false
weight = 2
+++

<div class="book-hint info">

> This page is an overview of all the personal things I host publicly. If you're looking for info about my homepage see [colophon]({{< relref "colophon" >}})
</div>

These things that I host publicly might be an overkill or maybe not the right way of doing things for some but this is going in the right direction for me, if not perfect. I need external systems and processes in place to help me get the most out of my life.


## Static pages {#static-pages}

-   [homepage](/) : This website
-   [mogoz](https://mogoz.geekodour.org) : The wiki, some people call it digital garden, evergreen notes etc.
-   [diary](https://diary.geekodour.org) : The public journal and travel diary
-   [todayi](https://ti.geekodour.org) : The place to keep my TILs and TIFUs.
-   [blog](https://blog.geekodour.org) : The blog
